In [ ]:
pwd

In [131]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [94]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [99]:
#number of players
num_players = len(purchase_data["SN"].unique())
num_players

576

In [100]:
#number of unique items
num_items = purchase_data["Item ID"].value_counts(dropna=False)
num_items.count()

183

In [112]:
#avg price
average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [105]:
#num purchases
num_purchases = purchase_data["Purchase ID"].count()
num_purchases

780

In [118]:
#total revenue
total_rev = (num_purchases) * (average_price)
total_rev.round(2)

2379.77

In [123]:
#pulling values into new summary_table
summary_table = pd.DataFrame({"Number of Unique Items":[num_items.count()],
                 "Average Price": [average_price],
                "Number of Purchases": [num_purchases],
                "Total Revenue": [total_rev]})
summary_table

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [129]:
genders = purchase_data.groupby("Gender")["SN"].nunique()
genders.head()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [134]:
#purchases by gender
gender_purchase = purchase_data.groupby("Gender")["Item Name"]
gender_purchase.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [137]:
#gender AIP (Average Item Price)
gender_aip = purchase_data.groupby("Gender")["Price"].mean()
gender_aip.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [139]:
#Revenue by Gender
gender_rev = purchase_data.groupby("Gender")["Price"].sum()
gender_rev

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [144]:
#purchase per person by gender
gender_avg_purchase = (gender_rev)/(gender_purchase.count())
gender_avg_purchase.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
dtype: float64

In [148]:
#gender analysis table
gender_analysis = pd.DataFrame({"Purchase Count":gender_purchase.count(),
                                "Average Purchase Price":gender_aip,
                                "Total Purchase Value":gender_rev,
                                "Avg Total Purchase per Person":gender_avg_purchase.round(2)})
gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,3.20
Male,652,3.017853,1967.64,3.02
Other / Non-Disclosed,15,3.346000,50.19,3.35

In [149]:
#bins for ages
bins = [0,10,15,20,25,30,35,40,45]
age_ranges = ["10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", ">=40"]
pd.cut(purchase_data["Age"], bins, labels = age_ranges)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
5      20-24
6      35-39
7      15-19
8      20-24
9      30-34
10     20-24
11     20-24
12     20-24
13     20-24
14     30-34
15     20-24
16     15-19
17     20-24
18     20-24
19     25-29
20     15-19
21     15-19
22     35-39
23     35-39
24     25-29
25     25-29
26     10-14
27        10
28     20-24
29     20-24
       ...
750    20-24
751    10-14
752    15-19
753    35-39
754    20-24
755    10-14
756    15-19
757    15-19
758    20-24
759    20-24
760    20-24
761     >=40
762    25-29
763    20-24
764    15-19
765    15-19
766    20-24
767       10
768    35-39
769    10-14
770    30-34
771    15-19
772    25-29
773    20-24
774    10-14
775    20-24
776    20-24
777    15-19
778       10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < >=40]

In [150]:
purchase_data["Age Range"] = pd.cut(purchase_data["Age"], bins, labels = age_ranges)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [152]:
#count of players in each age range
age_group = purchase_data.groupby("Age Range")["Item Name"]
age_group.count()

Age Range
10        32
10-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
>=40       7
Name: Item Name, dtype: int64

In [179]:
#percent of players in each age group
age_percent = round(age_group.count()/780,4)
age_percent

Age Range
10       0.0410
10-14    0.0692
15-19    0.2564
20-24    0.4167
25-29    0.0987
30-34    0.0667
35-39    0.0423
>=40     0.0090
Name: Item Name, dtype: float64

In [180]:
#age demographics table
age_demo = pd.DataFrame({"Total Count":age_group.count(),
                        "Percentage of Players":age_percent*100})
age_demo

           Total Count  Percentage of Players
Age Range
10                  32                   4.10
10-14               54                   6.92
15-19              200                  25.64
20-24              325                  41.67
25-29               77                   9.87
30-34               52                   6.67
35-39               33                   4.23
>=40                 7                   0.90

In [181]:
#purchasing analysis by age
#AIP by age
age_aip = purchase_data.groupby("Age Range")["Price"].mean()
age_aip.round(2)

Age Range
10       3.40
10-14    2.90
15-19    3.11
20-24    3.02
25-29    2.88
30-34    2.99
35-39    3.40
>=40     3.08
Name: Price, dtype: float64

In [182]:
#revenue by age
age_rev = purchase_data.groupby("Age Range")["Price"].sum()
age_rev

Age Range
10       108.96
10-14    156.60
15-19    621.56
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
>=40      21.53
Name: Price, dtype: float64

In [191]:
#avg purchse per person by age
age_purchase_per = (age_rev)/age_group.count()
age_purchase_per.round(2)

Age Range
10       3.40
10-14    2.90
15-19    3.11
20-24    3.02
25-29    2.88
30-34    2.99
35-39    3.40
>=40     3.08
dtype: float64

In [194]:
#Purchase Analysis Table
Purchase_Analysis = pd.DataFrame({"Purchase Count":age_group.count(),
                                 "Average Purchase Price":age_aip.round(2),
                                 "Total Purchase Value": age_rev,
                                 "Avg Total Purchase per Person":age_purchase_per.round(2)})
Purchase_Analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Range,,,,
10,32,3.40,108.96,3.40
10-14,54,2.90,156.60,2.90
15-19,200,3.11,621.56,3.11
20-24,325,3.02,981.64,3.02
25-29,77,2.88,221.42,2.88
30-34,52,2.99,155.71,2.99
35-39,33,3.40,112.35,3.40
>=40,7,3.08,21.53,3.08

In [261]:
#Top Spenders
top_buyers = purchase_data.groupby("SN").count()
top_buyers2 = top_buyers.rename(columns = {"Price":"Purchase Count"})
top_buyers2.head(5)

,Purchase ID,Age,Gender,Item ID,Item Name,Purchase Count,Age Range
SN,,,,,,,
Adairialis76,1,1,1,1,1,1,1
Adastirin33,1,1,1,1,1,1,1
Aeda94,1,1,1,1,1,1,1
Aela59,1,1,1,1,1,1,1
Aelaria33,1,1,1,1,1,1,1

In [262]:
#Avg by spender
top_buyer_avg = purchase_data.groupby("SN").mean()
top_buyer_avg = top_buyer_avg.rename(columns={"Price": "Average Purchase Price"})
top_buyer_avg.head()

              Purchase ID   Age  Item ID  Average Purchase Price
SN
Adairialis76        467.0  16.0    123.0                    2.28
Adastirin33         142.0  35.0    175.0                    4.48
Aeda94              388.0  17.0    128.0                    4.91
Aela59               28.0  21.0    119.0                    4.32
Aelaria33           630.0  23.0    171.0                    1.79

In [263]:
#Total spent by top buyers(((still needs some work!!!)))
player_spent = purchase_data.groupby("SN").sum()
player_spent.rename(columns={"Price":"Total Purchase Value"})
player_spent.head()

              Purchase ID  Age  Item ID  Price
SN
Adairialis76          467   16      123   2.28
Adastirin33           142   35      175   4.48
Aeda94                388   17      128   4.91
Aela59                 28   21      119   4.32
Aelaria33             630   23      171   1.79

In [264]:
#Top Spenders Table
top_spenders = pd.DataFrame([{"Purchase Count":top_buyers2,
                             "Average Purchase Price":top_buyer_avg,
                             "Totale Purchase Value":player_spent}])
                            
top_spenders.head(5)

,Average Purchase Price,Purchase Count,Totale Purchase Value
0,Purchase ID Age Item ID...,Purchase ID Age Gender Ite...,Purchase ID Age Item ID Pr...

In [ ]:
#Above table isn't right

In [306]:
#most popular items
items_purchase_count_df = purchase_data.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
items_average_price_df = purchase_data.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price")
items_value_total_df = purchase_data.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")

item_df = pd.DataFrame({"Purchase Count":items_purchase_count_df,
                                   "Item Price":items_average_price_df,
                                   "Total Purchase Value":items_value_total_df,})

item_df.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [307]:
#now we need to sort for popular items
most_pop_items = item_df.sort_values("Purchase Count", ascending = False)
most_pop_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16